#constants.py

# Главные клавиатуры
MAIN_MENU = [["Сбережения"], ["Кредиты"], ["Прогнозирование"]]
CREDITS_MENU = [["Просмотреть кредиты", "График платежей"], ["Добавить кредит", "Удалить кредит"], ["Изменение кредита"], ["Назад"]]
SAVINGS_MENU = [["Назад"]]
FORECAST_MENU = [["Рассчитать остаток на день"], ["Назад"]]

# Меню изменения кредита
CREDIT_MODIFICATION_MENU = [["Изменение даты платежа"], ["Досрочное погашение"], ["Назад"]]
CREDIT_REPAYMENT_MENU = [["Уменьшение срока"], ["Уменьшение платежа"], ["Назад"]]
CREDIT_MODIFICATION_MENU = [["Изменение даты платежа"], ["Досрочное погашение"], ["Назад"]]
CREDIT_REPAYMENT_MENU = [["Уменьшение срока"], ["Уменьшение платежа"], ["Назад"]]

BANKS = [["🟢 Сбербанк", "🔴 Альфа-Банк"], ["🟡 Тинькофф", "🔵 ВТБ"], ["🔵 Газпромбанк", "🟡 Райффайзенбанк"], ["Назад"]]
CATEGORIES = [["Ипотека", "Автокредит"], ["Кредит наличными"], ["Назад"]]